feaser/openblt/stm32u5_port/Target/Demo/TRICORE_TC3_TC375_Lite_Kit_ADS/Boot/Libraries/iLLD/TC37A/Tricore/Gtm/Tom/Dtm_PwmHl/IfxGtm_Tom_Dtm_PwmHl.c
    driver->base.mode             = Ifx_Pwm_Mode_init;
    driver->timer                 = timer;
    driver->base.setMode          = 0;
    driver->base.inverted         = FALSE;
    driver->base.ccxActiveState   = config->base.ccxActiveState;
    driver->base.coutxActiveState = config->base.coutxActiveState;
    driver->base.channelCount     = config->base.channelCount;

    driver->tom                  = &(timer->gtm->TOM[config->tom]);

    driver->tgc                   = (Ifx_GTM_TOM_TGC *)&driver->tom->TGC0_GLB_CTRL;

    IFX_ASSERT(IFX_VERBOSE_LEVEL_ERROR, config->base.channelCount <= IFXGTM_TOM_PWMHL_MAX_NUM_CHANNELS);

    IfxGtm_Cmu_Clk clock = IfxGtm_Tom_Ch_getClockSource(timer->tom, timer->timerChannel);

    for (channelIndex = 0; channelIndex < config->base.channelCount; channelIndex++)
    {
        IfxGtm_Tom_Ch channel;

        /* Initialise the Deadtime generation */
        driver->dtm[channelIndex] = IfxGtm_Dtm_getDtmPointer(timer->gtm, IfxGtm_Dtm_getCdtmIndex(config->tom), IfxGtm_Dtm_getDtmIndex(config->tom, config->ccx[channelIndex]->channel));
        result                   &= driver->dtm[channelIndex] != NULL_PTR;

        IFX_ASSERT(IFX_VERBOSE_LEVEL_ERROR, driver->dtm[channelIndex] != NULL_PTR);

        if (driver->dtm[channelIndex] != NULL_PTR)
        {
            /* CCX */
            channel                   = config->ccx[channelIndex]->channel;
            driver->ccx[channelIndex] = channel;
            channelMask               = 1 << channel;
            channelsMask             |= channelMask;

            /* Initialize the timer part */
            IfxGtm_Tom_Ch_setClockSource(driver->tom, channel, clock);
            IfxGtm_Tom_Ch_setResetSource( driver->tom, channel, IfxGtm_Tom_Ch_ResetEvent_onTrigger);
            IfxGtm_Tom_Ch_setSignalLevel(driver->tom, channel, config->base.ccxActiveState);
            IfxGtm_Tom_Ch_setTriggerOutput(driver->tom, channel, IfxGtm_Tom_Ch_OutputTrigger_forward);

            /* Initialize the DTM part */
            IFX_ASSERT(IFX_VERBOSE_LEVEL_ERROR, IfxGtm_Dtm_getDtmChannel(config->ccx[channelIndex]->channel) == IfxGtm_Dtm_getDtmChannel(config->coutx[channelIndex]->channel));

            IfxGtm_Dtm_setClockSource(driver->dtm[channelIndex], config->deadTimeClock);
            driver->dtmChannel[channelIndex] = IfxGtm_Dtm_getDtmChannel(config->ccx[channelIndex]->channel);
            IfxGtm_Dtm_setOutput0DeadTimePath(driver->dtm[channelIndex], driver->dtmChannel[channelIndex], IfxGtm_Dtm_DeadTimePath_enable);
            IfxGtm_Dtm_setOutput1DeadTimePath(driver->dtm[channelIndex], driver->dtmChannel[channelIndex], IfxGtm_Dtm_DeadTimePath_enable);

            /* Initialize the port */
            if (config->initPins == TRUE)
            {
                IfxGtm_PinMap_setTomTout(config->ccx[channelIndex],
                    ((config->base.ccxOutputEnabled & (0x1 << channelIndex)) != 0) ? config->base.outputMode : IfxPort_OutputMode_none, config->base.outputDriver);
            }

            /* COUTX */
            channel                     = config->coutx[channelIndex]->channel;
            driver->coutx[channelIndex] = channel;

            /* Initialize the port */
            if (config->initPins == TRUE)
            {
                IfxGtm_PinMap_setTomTout(config->coutx[channelIndex],
                    ((config->base.coutxOutputEnabled & (0x1 << channelIndex)) != 0) ? config->base.outputMode : IfxPort_OutputMode_none, config->base.outputDriver);
            }
        }
    }

    /* Initialize the clock value, assumes all DTM are connected to the same clock */
    if (config->base.channelCount > 0)
    {
        driver->dtmClockFreq = IfxGtm_Dtm_getClockFrequency(timer->gtm, IfxGtm_Dtm_getCdtmIndex(config->tom), IfxGtm_Dtm_getDtmIndex(config->tom, config->ccx[0]->channel));
        result              &= IfxGtm_Tom_Dtm_PwmHl_setDeadtime(driver, config->base.deadtime);
    }
    else
    {
        driver->dtmClockFreq = 0;
    }

    IfxGtm_Tom_Dtm_PwmHl_setMinPulse(driver, config->base.minPulse); // must be called after IfxGtm_TomDtm_PwmHl_setDeadtime

    IfxGtm_Tom_Tgc_enableChannelsOutput(driver->tgc, channelsMask, 0, FALSE);
    IfxGtm_Tom_Tgc_enableChannels(driver->tgc, channelsMask, 0, FALSE);

    IfxGtm_Tom_Dtm_PwmHl_setMode(driver, Ifx_Pwm_Mode_off);

    Ifx_TimerValue tOn[IFXGTM_TOM_DTM_PWMHL_MAX_NUM_CHANNELS] = {0};
    IfxGtm_Tom_Dtm_PwmHl_updateOff(driver, tOn); /* tOn do not need defined values */

    /* Transfer the shadow registers */
    IfxGtm_Tom_Tgc_setChannelsForceUpdate(driver->tgc, channelsMask, 0, 0, 0);
    IfxGtm_Tom_Tgc_trigger(driver->tgc);
    IfxGtm_Tom_Tgc_setChannelsForceUpdate(driver->tgc, 0, channelsMask, 0, 0);

    /* Enable timer to update the channels */

    for (channelIndex = 0; channelIndex < driver->base.channelCount; channelIndex++)
    {
        IfxGtm_Tom_Timer_addToChannelMask(timer, driver->ccx[channelIndex]);
    }

    return result;
}


void IfxGtm_Tom_Dtm_PwmHl_initConfig(IfxGtm_Tom_Dtm_PwmHl_Config *config)
{
    IfxStdIf_PwmHl_initConfig(&config->base);
    config->timer         = NULL_PTR;
    config->tom          = IfxGtm_Tom_0;
    config->ccx           = NULL_PTR;
    config->coutx         = NULL_PTR;
    config->deadTimeClock = IfxGtm_Dtm_ClockSource_systemClock;
    config->initPins      = TRUE;
}


float32 IfxGtm_Tom_Dtm_PwmHl_getDeadtime(IfxGtm_TomDtm_PwmHl *driver)
{
    return IfxStdIf_Timer_tickToS(driver->dtmClockFreq, driver->base.deadtime);
}


Ifx_TickTime IfxGtm_Tom_Dtm_PwmHl_getDeadtimeTick(IfxGtm_TomDtm_PwmHl *driver)
{
    return driver->base.deadtime;
}


float32 IfxGtm_Tom_Dtm_PwmHl_getMinPulse(IfxGtm_TomDtm_PwmHl *driver)
{
    return IfxStdIf_Timer_tickToS(driver->timer->base.clockFreq, driver->base.minPulse - IfxGtm_Tom_Dtm_PwmHl_getDeadtimeInTimerClockTicks(driver));
}


Ifx_Pwm_Mode IfxGtm_Tom_Dtm_PwmHl_getMode(IfxGtm_TomDtm_PwmHl *driver)
{
    return driver->base.mode;
}


boolean IfxGtm_Tom_Dtm_PwmHl_setDeadtime(IfxGtm_TomDtm_PwmHl *driver, float32 deadtime)
{
    uint32         channelIndex;
    Ifx_TimerValue value = IfxStdIf_Timer_sToTick(driver->dtmClockFreq, deadtime);

    if (value > IFXGTM_TOM_DTM_PWMHL_MAX_DEADTIME_IN_TICKS)
    {
        return FALSE;
    }
    else
    {
        driver->base.deadtime = value;

